# -*- coding: utf-8 -*-
'''
Задание 4.8

Преобразовать IP-адрес в двоичный формат и вывести вывод столбцами, таким образом:
- первой строкой должны идти десятичные значения байтов
- второй строкой двоичные значения

Вывод должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов

Пример вывода для адреса 10.1.1.1:
10        1         1         1
00001010  00000001  00000001  00000001

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

IP = '192.168.3.1'
IP = IP.strip().split( '.' )

print_template = '''
decimal: {0:10} {1:10} {2:10} {3:10}
binary : {0:10b} {1:10b} {2:10b} {3:10b}
'''

print( print_template.format( int( IP[0] ), int( IP[1] ), int( IP[2] ), int( IP[3] ) ) )
